{"Name": "",
 "Path": "",
 "Parameters":{ #Should be in the command line order
	"Mode": ["automatic", "manual"],
	"command_line_base": "", #OPTIONAL
	"Intermediate": "", #OPTIONAL possibilities: Matlab, AnyWave, Python
	"Callname": "",
	"Input": [
		{ 
		 "tag": "", 
		 "multiplesubject": true or false, 
		 "modality": [], 
		 "type": "dir" or "file", 
		 #the following part is optional, you should mention it if the input of your software is located in derivatives folder.
		 "deriv-folder": "", #No value needed, it will be offered to the user according to the derivatives folders presents in bids dataset
		 "filetype": "", #give the file extension
		 "optional": true or false
		 } #tag is the key of this argument in the command line. modality is to know which data is taken in entry.
		#if multiple dictionnary, it means the software needs multiple entry
		],
	"Output": {
		"tag": "", #tag is the key of this argument in the command line
		"multiplesubject": true or false,
		"directory": true or false, #fileloc is fill in by bids manager to give the localisation to write the results
		"type": "dir" or "file", 
		"extension": []#Give the type of output ex: tsv, pdf
		#if all the key are empty, it means the software write by himself the result in the appropriate folder or there is no output
	},
	"key": { #key is an argument of the software, it can be start, duration, etc
		"default": "", #default value, but user will have the chance to modify it
		"unit": ""
		},
		OR
		"read": "", #read a file in the bids directory to give a list of possibility to the user
		"elementstoread": "", #Give the index or the header name to read
		"multipleselection": true or false
		OR
		"possible_value": [], #list of possible value
		"multipleselection": true or false
		OR
		"fileLoc": "", #User has to specify filename with path (select from GUI)
		"extension": "" #extension of the selected file
		OR
		"default": true or false #Boolean choice to put this parameter or not in the command line
		OR
		"readbids": true, #those arguments is to specify the software needs specific values from bids specificity
		"type": "", #e.g sub, ses, task, acq, modality, etc
	}
}

