{"Name": "",							#Name of the module
 "Path": "",							#Path of the module
 "Parameters":{ 						#Should be in the command line order
	"Mode": ["automatic", "manual"],	#Choose if the analyis should be done automatically or manually
	"command_line_base": "", 			#OPTIONAL
	"Intermediate": "", 				#OPTIONAL possibilities: Matlab, AnyWave, Python
	"Callname": "",						#Name to call the module
	"Input": [
		{ 
		"Tag": "", 						#Tag is the key of this argument in the command line. 
		"MultipleSubject": true/false, 	#To know if the module can handle data of multiple subject at once
		"Modality": [], 				#Modality is to know which data is taken as input.
		"Type": "",						#Type indicate if it is a file or a folder (i.e "dir", "file", "4D" or "montage")
		"DerivFolder": "", 				#Adding this key means the input files are in one derivatives folder
		"FileType": "",					#This key is coming with the 'DerivFolder' one, indicating which file is 
										#required as input (e.g. "*.mat")
		"CombinationMode": true/false,	#This key is to indicate, if multiple inputs, BMP has to use the same file with differents files of the other input								
		"Optional": true/false			#Saying if this input is required or not
		} 								#if multiple dictionnary, it means the module needs multiple entry
		],
	"Output": {
		"Tag": "", 						#Tag is the key of this argument in the command line
		"MultipleSubject": true/false,
		"Directory": true/false,		#Direcory is fill in by bids manager to give the localisation to write the results
		"Type": "dir" or "file", 		#If the module require pathname or filename as output
		"Extension": ""					#Give the type of output ex, tsv, pdf
										#if all the key are empty, it means the module write by himself the result 
										#in the appropriate folder or there is no output
	},
	"key": { 							#key is an argument of the module, the one appearing in the command line
		#Number type
		"Default": "", 					#default value, but user will have the chance to modify it
		"Unit": ""
		OR
		#Value read in the database
		"Read": "", 					#file name/type to read in the bids directory to give a selection to the user
		"ElementsToRead": "", 			#Give the indndex or the header to read
		"MultipleSelection": true/false	#If the user can select multiple variable for this parameter
		OR
		#Specific Value
		"PossibleValue": [], 			#values that user can choose
		"MultipleSelection": true/false
		OR
		#Path to a file
		"FileLoc": "", 					#User has to specify filename with path (select from GUI)
		"Extension": ""
		OR
		#Boolean Value
		"Default": true/false,
		"InCommandLine": true/false		#Boolean choice to put this parameter or not in the command line
		OR
		#Value specific to BIDS
		"ReadBids": true, 				#those arguments is to specify the module needs specific values from bids specificity
		"Type": "", 					#e.g sub, ses, task, acq, modality, etc
		}
	}
}

